#pragma once

#include "Types.h"
#include "Utility.h"
#include "Serialization/SerializableList.h"
#include "Serialization/SerializationTypePlayground.h"
namespace AVG
{

	class ExtraValueInfo;
	class AdaptiveValueInfo;
	class ExclusiveValueInfo;
	class FunctionalValueInfo;


	
	


	/*
	
	//This should allow me to make them like: "ExtraValueInfoFactory::Create("AdaptiveValueInfo")
	//using ExtraValueInfoItemFactory = ClassFactory<ExtraValueInfo, StringLiteral>;
	
	//template <class DerivedType, StringLiteral Type>
	//using ExtraValueInfoFactoryComponent = IndirectFactoryComponent<ExtraValueInfo, StringLiteral, DerivedType, Value>;

	static RoutineItem* Create(RecordIterator& data, uint16_t pos, RoutineItemType type)//Include record.
	{
		RoutineItem* item = RoutineItemFactory::Create(type);

		item->_position = pos;

		item->LoadFromViewImpl(data);

		return item;
	}

	template<std::derived_from<RoutineItem> DerivedItem>
	inline static DerivedItem* CreateAs(RecordIterator& data, uint16_t pos, RoutineItemType type)//Include record.
	{
		RoutineItem* item = Create(data, pos, type);

		DerivedItem* result = dynamic_cast<DerivedItem*>(item);

		//This needs to be handled better
		if (!result) {
			delete item;
		}

		return result;
	}
	//*/

    //All of these will likely be changed to info at some later point.

	//This is the info needed to treat this av like a skill, growing when given experience. Player only obviously.
	//Unimplmented obviously

	//While I would say no reason to have this on the player object, that's not really true, so lets get to fixing that. into something else.
	
	
	struct SkillInfo
	{
		float useMult;        // 00
		float offsetMult;     // 04
		float improveMult;    // 08
		float improveOffset;  // 0C
	};

	struct SkillData
	{
		float			level;
		float			xp;
		float			levelThreshold;
		std::uint32_t	legendaryLevels;
	};
	
	struct SkillData_original
	{
		//So this would be the storage stuff,
		struct PlayerSkills
		{
		public:
			struct Data
			{
			public:
				struct Skills
				{
					enum Skill : std::uint32_t
					{
						kOneHanded = 0,
						kTwoHanded = 1,
						kArchery = 2,
						kBlock = 3,
						kSmithing = 4,
						kHeavyArmor = 5,
						kLightArmor = 6,
						kPickpocket = 7,
						kLockpicking = 8,
						kSneak = 9,
						kAlchemy = 10,
						kSpeech = 11,
						kAlteration = 12,
						kConjuration = 13,
						kDestruction = 14,
						kIllusion = 15,
						kRestoration = 16,
						kEnchanting = 17,
						kTotal
					};
				};
				using Skill = Skills::Skill;

				struct SkillData
				{
				public:
					// members
					float level;           // 0
					float xp;              // 4
					float levelThreshold;  // 8
				};
				static_assert(sizeof(SkillData) == 0xC);

				// members
				float         xp;                              // 000
				float         levelThreshold;                  // 004
				SkillData     skills[Skill::kTotal];           // 008
				std::uint32_t legendaryLevels[Skill::kTotal];  // 0E0
			};
			static_assert(sizeof(Data) == 0x128);

			void AdvanceLevel(bool a_addThreshold);

			// members
			Data* data;  // 0
		};
		//and this would be the EVI stuff
		struct Base  // AVSK
		{
			
		};

		//float experience;
        //float levelUpAt;
	};

	using ValueFormula = LEX::Formula<float(RE::Actor::*)()>;
	using SetFormula = LEX::Formula<void(RE::Actor::*)(RE::Actor*, float, float)>;


	//This is functionally default data. Update data isn't something I'll want to implement for a while, and since this doesn't serialize I'm comfortable
	// doing it later.
    struct DefaultData
    {
		enum Type
		{
			Implicit,	//The values will be set on start, and will not update
			Explicit,	//The values can only change from defined default when done so explicitly
			Constant,	//The values never change from the defined default
		};

		Type _type = Type::Implicit;

		//rate is required.
